app/Controllers/Product.php

    public function index()
    {
        $model = new ProductModel();
        $products = $model->findAll();
---
SELECT *
FROM `products`

    public function create()
    {
        $model = new ProductModel();

        // استقبال البيانات القادمة من تطبيق الهاتف بصيغة JSON
        $json = $this->request->getJSON();

        // التحقق من أن البيانات ليست فارغة
        if (!empty($json)) {
            $data = [
                'name'  => $json->name,
                'price' => $json->price
            ];

            // إدخال البيانات إلى قاعدة البيانات عبر الموديل
            if ($model->insert($data)) {
---
INSERT INTO `products` (`name`, `price`, `created_at`, `updated_at`) VALUES ('برتقال ', 6, '2026-05-28 22:41:04', '2026-05-28 22:41:04')

    public function delete($id = null)
    {
        $model = new ProductModel();

        // التأكد من أن المنتج موجود فعلياً في قاعدة البيانات
        $product = $model->find($id);

        if ($product) {
            // تنفيذ الحذف
            $model->delete($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '3'
DELETE FROM `products`
WHERE `id` IN ('3')

    public function update($id = null)
    {
        $model = new ProductModel();

        // التأكد من وجود المنتج أولاً
        $product = $model->find($id);
        if (!$product) {
            $this->setCorsHeaders();
            return $this->failNotFound('المنتج غير موجود');
        }

        // قراءة البيانات الجديدة المرسلة بصيغة JSON
        $json = $this->request->getJSON();

        if (!empty($json)) {
            $data = [
                'name'  => $json->name,
                'price' => $json->price
            ];

            // تحديث البيانات في الجدول بناءً على الـ id
            if ($model->update($id, $data)) {
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'
UPDATE `products` SET `name` = 'تفاح أحمر', `price` = 4, `updated_at` = '2026-05-28 22:40:42'
WHERE `products`.`id` IN ('1')